Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/colleges_and_qualifications/going_to_college_life_event.html.txt.tmx
Source language: en
Languages: ga

source: When you are leaving school you may be intending to start work or you may be planning to go to college
ga: Agus tú ag fágáil na scoile b’fhéidir go mbeidh tú ag brath ar thosú ag obair nó go mbeidh rún agat dul ar coláiste

source: Many young people go onto to third-level or higher education after they have obtained their Leaving Certificate
ga: Téann go leor daoine óga ar aghaidh chun an oideachais tríú leibhéil nó ardleibhéil tar éis dóibh an Ardteistiméireacht a fháil

source: Some people work for a number of years and then go to college as mature students
ga: Caitheann daoine áirithe suim blianta ag obair agus téann siad ar coláiste ansin mar mhic léinn lánfhásta

source: If you are not an Irish national or you live outside Ireland you can find information in our document on moving to Ireland for third-level education
ga: Murar saoránach d’Éirinn tú nó má tá tú i do chónaí lasmuigh d’Éirinn féadfaidh tú faisnéis a fháil inár ndoiciméad faoi theacht go hÉirinn le haghaidh oideachais tríú leibhéal

source: Thinking of going to college
ga: Ag brath ar dhul ar coláiste

source: If you are interested in doing a third-level course, you need to start thinking about it before you leave school
ga: Más suim leat cúrsa tríú leibhéil a dhéanamh, níor mhór duit smaoineamh air sula bhfágfaidh tú an scoil

source: The Qualifax website has a wide range of information about higher and further education courses, from university degrees to certificates and diplomas in further education colleges and institutes of technology
ga: Tá raon leathan faisnéise le fáil ar an láithreán gréasáin Qualifax faoi chúrsaí ardoideachais agus breisoideachais, ó chéimeanna ollscoile go dtí teastais agus dioplómaí i gcoláistí breisoideachais agus in institiúidí teicneolaíochta

source: More information can be found in our document on further and higher education qualifications which are all now included in the National Framework of Qualifications
ga: Is féidir a thuilleadh faisnéise a fháil inár ndoiciméad faoi cháilíochtaí breis- agus ardoideachais, agus áirítear iad seo go léir anois i gCreat Náisiúnta na gCáilíochtaí

source: You need to check the application procedures for third-level college before you start your last year at school
ga: Níor mhór duit na gnáthaimh iarratais ar choláistí tríú leibhéil a scrúdú sula dtosaíonn tú ar do bhliain deiridh ar scoil

source: If you are thinking of studying in the UK or abroad you will need to find out about what is involved and you may wish to visit a college before you apply
ga: Má tá tú ag brath ar staidéar a dhéanamh sa RA nó thar lear níor mhór duit tú féin a chur ar an eolas faoina bhfuil le déanamh agus b’fhéidir gur mhaith leat cuairt a thabhairt ar choláiste sula ndéanann tú an t-iarratas

source: If you have a disability or you are a school-leaver from a socially disadvantaged background there are supports to help you to access third-level education
ga: Má tá tú faoi mhíchumas nó más fágálaí scoile thú ó chúlra atá faoi mhíbhuntáiste sóisialta, tá tacaíochtaí ann chun cabhrú leat rochtain a fháil ar oideachas tríú leibhéal

source: You should check whether you have to pay fees for your college course
ga: Níor mhór duit féachaint an gcaithfidh tú táillí a íoc as do chúrsa coláiste

source: Most students doing undergraduate courses do not have to pay the fees
ga: Ní bhíonn ar bhunáite mhic léinn na hÉireann a bhíonn ag déanamh cúrsaí fochéime táillí a íoc

source: If you do have to pay fees you may claim tax relief on the fees for most third-level courses
ga: Ach má tá ort táillí a íoc féadfaidh tú faoiseamh cánach a éileamh ar tháillí bunáite na gcúrsaí tríú leibhéil

source: There are means-tested maintenance grants for students doing third-level courses
ga: Tá deontais chothabhála tástáilte ó thaobh acmhainne le fáil ag mic léinn atá ag déanamh cúrsaí tríú leibhéil

source: The website studentfinance.ie has information about the full range of grants and supports available
ga: Gheofar faisnéis faoi raon iomlán na ndeontas agus na tacaíochta atá le fáil ar an láithreán gréasáin studentfinance.ie

source: Many students live at home while at college but you may live too far away to travel there every day
ga: Bíonn go leor mac léinn ina gcónaí sa bhaile agus iad ar coláiste ach b’fhéidir go bhfuil cónaí ortsa rófhada ar shiúl le go bhféadfá taisteal ann gach lá

source: Many colleges have residences for some students but you may have to rent accommodation near the college
ga: Tá árais chónaithe do mhic léinn áirithe ag cuid mhaith de na coláistí ach b’fhéidir go gcaithfidh tusa cóiríocht a fháil ar cíos in aice an choláiste

source: You may be looking for a house or flat to rent and, if you find one, you should be aware of your rights as a tenant
ga: B’fhéidir go mbeidh tú ag iarraidh teach nó árasán a fháil ar cíos agus má fhaigheann tú ceann ba cheart go dtuigfeá do chearta mar thionónta

source: When you are choosing a college course, it is important to find out as much information about the course and the college you wish to attend
ga: Agus tú ag roghnú cúrsa coláiste, níor mhór duit an oiread faisnéise agus is féidir a fháil faoin gcúrsa agus faoin gcoláiste ar mhaith leat freastal air

source: There is a list of the websites of higher education institutions in Ireland on the studentfinance.ie website
ga: Tá liosta de láithreáin ghréasáin na n-institiúidí ardoideachais ar an láithreán studentfinance.ie
